/**
 * ? 설계하는 법
 * * 1. 지나치다 싶을 만큼 펼쳐낸다.
 * * 2. 목적과 기술을 혼동하지 않도록 구분한다.(※ 가장 많이 일어나는 착각)
 * * 3. 학습요소도 프로젝트의 일부로 포함한다.
 * * 4. 요소에 대한 정확한 작명을 반드시 진행한다.
 * * 5. 입력요소, 출력요소, 구성요소 누락을 '찾듯이' 점검한다.
 * * 6. 가상의 미래에 내가 언제든지 보아도 해당 프로젝트나 파일에 대해 빠른 파악이 가능한 수준이어야 한다. (계속 코드를 다듬어야 하기 때문)
 * * 7. 파일이 10,000개 단위(사람의 인지수준을 한참 뛰어 넘는양)를 다루어야 한다는 상황을 가정한다.
 */

/**
 * todo: webserver 제작
 * pseudo1: express.js를 활용한다.
 * pseudo2: GET요청에 대응한다.
 * *문서를 조립하는 route.js 구조
 * *예상되는 요청 "/"
 * 
 * pseudo3. POST요청에 대응한다.
 * * action = "/mainPromptInputData"
 * * method = "POST"
 */


/** 
 * todo: 찾아볼 기술
 * pseudo4: express.js
 * *express.js의 기본적인 사용법
 * *express static 기능
 * *express router 기능
 * *express middleware 기능
 * *찾아보면서 추가하기
 */

